In [2]:
pip install pyarrow

Collecting pyarrow
  Downloading pyarrow-17.0.0-cp312-cp312-win_amd64.whl.metadata (3.4 kB)
Requirement already satisfied: numpy>=1.16.6 in c:\users\dtp394\appdata\local\programs\python\python312\lib\site-packages (from pyarrow) (1.26.4)
Downloading pyarrow-17.0.0-cp312-cp312-win_amd64.whl (25.1 MB)
   ---------------------------------------- 0.0/25.1 MB ? eta -:--:--
   - -------------------------------------- 0.8/25.1 MB 6.7 MB/s eta 0:00:04
   --- ------------------------------------ 2.1/25.1 MB 5.9 MB/s eta 0:00:04
   ----- ---------------------------------- 3.7/25.1 MB 6.4 MB/s eta 0:00:04
   ------- -------------------------------- 4.7/25.1 MB 6.3 MB/s eta 0:00:04
   --------- ------------------------------ 5.8/25.1 MB 6.1 MB/s eta 0:00:04
   ---------- ----------------------------- 6.6/25.1 MB 5.5 MB/s eta 0:00:04
   ----------- ---------------------------- 7.3/25.1 MB 5.1 MB/s eta 0:00:04
   ------------ --------------------------- 7.9/25.1 MB 4.9 MB/s eta 0:00:04
   ------------- -------------------------- 8.4/25.1 MB 4.6 MB/s eta 0:00:04
   -------------- ------------------------- 9.2/25.1 MB 4.3 MB/s eta 0:00:04
   --------------- ------------------------ 9.7/25.1 MB 4.2 MB/s eta 0:00:04
   --------------- ------------------------ 10.0/25.1 MB 4.1 MB/s eta 0:00:04
   ---------------- ----------------------- 10.5/25.1 MB 3.8 MB/s eta 0:00:04
   ----------------- ---------------------- 10.7/25.1 MB 3.6 MB/s eta 0:00:04
   ----------------- ---------------------- 11.0/25.1 MB 3.5 MB/s eta 0:00:04
   ----------------- ---------------------- 11.3/25.1 MB 3.4 MB/s eta 0:00:05
   ------------------ --------------------- 11.8/25.1 MB 3.3 MB/s eta 0:00:05
   ------------------- -------------------- 12.3/25.1 MB 3.2 MB/s eta 0:00:05
   -------------------- ------------------- 12.6/25.1 MB 3.1 MB/s eta 0:00:05
   -------------------- ------------------- 12.8/25.1 MB 3.0 MB/s eta 0:00:05
   -------------------- ------------------- 13.1/25.1 MB 2.9 MB/s eta 0:00:05
   -------------------- ------------------- 13.1/25.1 MB 2.9 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.4/25.1 MB 2.7 MB/s eta 0:00:05
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   --------------------- ------------------ 13.6/25.1 MB 1.9 MB/s eta 0:00:06
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 13.9/25.1 MB 1.5 MB/s eta 0:00:08
   ---------------------- ----------------- 14.2/25.1 MB 1.3 MB/s eta 0:00:09
   ---------------------- ----------------- 14.2/25.1 MB 1.3 MB/s eta 0:00:09
   ---------------------- ----------------- 14.2/25.1 MB 1.3 MB/s eta 0:00:09
   ---------------------- ----------------- 14.4/25.1 MB 1.3 MB/s eta 0:00:09
   ---------------------- ----------------- 14.4/25.1 MB 1.3 MB/s eta 0:00:09
   ----------------------- ---------------- 14.7/25.1 MB 1.2 MB/s eta 0:00:09
   ----------------------- ---------------- 14.7/25.1 MB 1.2 MB/s eta 0:00:09
   ----------------------- ---------------- 14.9/25.1 MB 1.2 MB/s eta 0:00:09
   ----------------------- ---------------- 14.9/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------ --------------- 15.2/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------ --------------- 15.2/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------ --------------- 15.5/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------- -------------- 15.7/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------- -------------- 15.7/25.1 MB 1.2 MB/s eta 0:00:09
   ------------------------- -------------- 16.0/25.1 MB 1.2 MB/s eta 0:00:08
   ------------------------- -------------- 16.0/25.1 MB 1.2 MB/s eta 0:00:08
   ------------------------- -------------- 16.3/25.1 MB 1.1 MB/s eta 0:00:08
   -------------------------- ------------- 16.5/25.1 MB 1.1 MB/s eta 0:00:08
   -------------------------- ------------- 16.5/25.1 MB 1.1 MB/s eta 0:00:08
   -------------------------- ------------- 16.8/25.1 MB 1.1 MB/s eta 0:00:08
   --------------------------- ------------ 17.0/25.1 MB 1.1 MB/s eta 0:00:08
   --------------------------- ------------ 17.3/25.1 MB 1.1 MB/s eta 0:00:07
   ---------------------------- ----------- 17.8/25.1 MB 1.1 MB/s eta 0:00:07
   ---------------------------- ----------- 18.1/25.1 MB 1.1 MB/s eta 0:00:07
   ----------------------------- ---------- 18.4/25.1 MB 1.1 MB/s eta 0:00:06
   ----------------------------- ---------- 18.6/25.1 MB 1.1 MB/s eta 0:00:06
   ------------------------------ --------- 19.1/25.1 MB 1.2 MB/s eta 0:00:06
   ------------------------------ --------- 19.4/25.1 MB 1.2 MB/s eta 0:00:05
   ------------------------------- -------- 19.9/25.1 MB 1.2 MB/s eta 0:00:05
   -------------------------------- ------- 20.2/25.1 MB 1.2 MB/s eta 0:00:05
   --------------------------------- ------ 20.7/25.1 MB 1.2 MB/s eta 0:00:04
   --------------------------------- ------ 21.0/25.1 MB 1.2 MB/s eta 0:00:04
   ---------------------------------- ----- 21.5/25.1 MB 1.2 MB/s eta 0:00:03
   ---------------------------------- ----- 21.8/25.1 MB 1.2 MB/s eta 0:00:03
   ----------------------------------- ---- 22.0/25.1 MB 1.2 MB/s eta 0:00:03
   ----------------------------------- ---- 22.5/25.1 MB 1.2 MB/s eta 0:00:03
   ------------------------------------ --- 23.1/25.1 MB 1.2 MB/s eta 0:00:02
   ------------------------------------- -- 23.3/25.1 MB 1.2 MB/s eta 0:00:02
   ------------------------------------- -- 23.6/25.1 MB 1.2 MB/s eta 0:00:02
   -------------------------------------- - 24.1/25.1 MB 1.3 MB/s eta 0:00:01
   ---------------------------------------  24.6/25.1 MB 1.3 MB/s eta 0:00:01
   ---------------------------------------  24.9/25.1 MB 1.3 MB/s eta 0:00:01
   ---------------------------------------  24.9/25.1 MB 1.3 MB/s eta 0:00:01
   ---------------------------------------- 25.1/25.1 MB 1.3 MB/s eta 0:00:00
Installing collected packages: pyarrow
Successfully installed pyarrow-17.0.0
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

In [4]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [5]:
df=pd.DataFrame(people)

df.head(10)

In [9]:
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [17]:
df.head(10)

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [14]:
df.dropna(inplace=True)

In [15]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [31]:
import pandas as pd
import numpy as np

df_3 = pd.DataFrame({
    'A': [1, 2, 9, 4],
    'B': [np.nan, 2, 3, 4],
    'C': [1, np.nan, 3, np.nan]
})

In [32]:
df_3

   A    B    C
0  1  NaN  1.0
1  2  2.0  NaN
2  9  3.0  3.0
3  4  4.0  NaN

In [33]:
df_3.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2  False  False  False
3  False  False   True

In [37]:
df_3[df_3.isnull().any(axis=1)]

   A    B    C
0  1  NaN  1.0
1  2  2.0  NaN
3  4  4.0  NaN

In [38]:
df_3.isnull().any(axis=1)

0     True
1     True
2    False
3     True
dtype: bool

In [39]:
df_3.isnull().any(axis=0)

A    False
B     True
C     True
dtype: bool

In [41]:
df_3.fillna(0,inplace=True)

In [42]:
df_3

   A    B    C
0  1  0.0  1.0
1  2  2.0  0.0
2  9  3.0  3.0
3  4  4.0  0.0

In [43]:
df1 = pd.DataFrame({
    'A': [1, 2, 9, 4],
    'B': [np.nan, 2, 3, 4],
    'C': [1, np.nan, 3, np.nan]
})

In [46]:
df1

   A    B    C
0  1  NaN  1.0
1  2  2.0  NaN
2  9  3.0  3.0
3  4  4.0  NaN

In [47]:
df1.fillna(method='ffill')

C:\Users\DTP394\AppData\Local\Temp\ipykernel_4732\598575452.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='ffill')

   A    B    C
0  1  NaN  1.0
1  2  2.0  1.0
2  9  3.0  3.0
3  4  4.0  3.0

In [48]:
df1.fillna(method='bfill')

C:\Users\DTP394\AppData\Local\Temp\ipykernel_4732\2949398996.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='bfill')

   A    B    C
0  1  2.0  1.0
1  2  2.0  3.0
2  9  3.0  3.0
3  4  4.0  NaN

In [50]:
df1.fillna(method='ffill',axis=0)

C:\Users\DTP394\AppData\Local\Temp\ipykernel_4732\2993264929.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='ffill',axis=0)

   A    B    C
0  1  NaN  1.0
1  2  2.0  1.0
2  9  3.0  3.0
3  4  4.0  3.0

In [51]:
df1

   A    B    C
0  1  NaN  1.0
1  2  2.0  NaN
2  9  3.0  3.0
3  4  4.0  NaN

In [52]:
import pandas as pd
from io import StringIO

data = """A,B,C
1,foo,NA
2,bar,5
3,N/A,6
4,NULL,7
"""

# Reading data
df = pd.read_csv(StringIO(data), keep_default_na=True)

print(df)

   A    B    C
0  1  foo  NaN
1  2  bar  5.0
2  3  NaN  6.0
3  4  NaN  7.0

In [54]:
df_1=df.replace(np.NaN,0.0)

In [55]:
df_1

   A    B    C
0  1  foo  0.0
1  2  bar  5.0
2  3  0.0  6.0
3  4  0.0  7.0

In [58]:
df.replace({'B':np.NaN},df['A'].mean())

   A    B    C
0  1  foo  NaN
1  2  bar  5.0
2  3  2.5  6.0
3  4  2.5  7.0

In [ ]:
import pandas as pd

# Sample DataFrame
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Marks': [85, 90, 80, 95]
}

df = pd.DataFrame(data)

In [59]:
df

   A    B    C
0  1  foo  NaN
1  2  bar  5.0
2  3  NaN  6.0
3  4  NaN  7.0

In [62]:
df[df['A']==3]

   A    B    C
2  3  NaN  6.0

In [64]:
df.fillna(1,inplace=True)

In [65]:
df

   A    B    C
0  1  foo  1.0
1  2  bar  5.0
2  3    1  6.0
3  4    1  7.0

In [67]:
df['C'].mean()

4.75

In [68]:
import pandas as pd

# Sample DataFrame
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Marks': [85, 90, 80, 95]
}

d_f = pd.DataFrame(data)

In [69]:
d_f

   Student  Marks
0    Alice     85
1      Bob     90
2  Charlie     80
3    David     95

In [70]:
d_f['Marks']>85

0    False
1     True
2    False
3     True
Name: Marks, dtype: bool

In [71]:
d_f.loc[d_f['Marks']>85,'Student']

1      Bob
3    David
Name: Student, dtype: object

In [72]:
d_f.columns

Index(['Student', 'Marks'], dtype='object')

In [73]:
d_f.columns = ['student','marks']

In [74]:
d_f

   student  marks
0    Alice     85
1      Bob     90
2  Charlie     80
3    David     95

In [ ]:
d

In [76]:
d_f['student'] = d_f['student'].apply(len)

In [77]:
d_f

   student  marks
0        5     85
1        3     90
2        7     80
3        5     95

In [105]:
d_f.sort_values(by=['student','marks'],ascending=True)

   student  marks
1        3     90
0        5     85
3        5     95
2        7     80

In [82]:
import pandas as pd

# Sample DataFrame
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Marks': [85, 90, 80, 95]
}

df5 = pd.DataFrame(data)

In [83]:
df5.columns

Index(['Student', 'Marks'], dtype='object')

In [84]:
df5['Student'] = df5['Student'].str.upper()

In [88]:
df5['student'].apply(len)

0    5
1    3
2    7
3    5
Name: student, dtype: int64

In [86]:
df5.columns = ['student','marks']
df5.columns

Index(['student', 'marks'], dtype='object')

In [90]:
len(df5['student'])

4

In [92]:
df5.apply(len,axis='columns')

0    2
1    2
2    2
3    2
dtype: int64

In [94]:
import pandas as pd

# Create a dictionary with two columns of string data
data = {
    'Column1': ['apple', 'banana', 'cherry', 'date'],
    'Column2': ['red', 'yellow', 'dark red', 'brown']
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

  Column1   Column2
0   apple       red
1  banana    yellow
2  cherry  dark red
3    date     brown

In [95]:
df['full'] = df['Column1'] + df['Column2']
df

  Column1   Column2            full
0   apple       red        applered
1  banana    yellow    bananayellow
2  cherry  dark red  cherrydark red
3    date     brown       datebrown

In [96]:
df['full_1'] = df.Column1 + '  ' + df.Column2

In [97]:
df

  Column1   Column2            full            full_1
0   apple       red        applered        apple  red
1  banana    yellow    bananayellow    banana  yellow
2  cherry  dark red  cherrydark red  cherry  dark red
3    date     brown       datebrown       date  brown

In [98]:
df.drop(columns=['full','full_1'],inplace=True)

In [99]:
df

  Column1   Column2
0   apple       red
1  banana    yellow
2  cherry  dark red
3    date     brown

In [103]:
df.sort_values(by=['Column1'],ascending=True,inplace=True)

In [104]:
df

  Column1   Column2
0   apple       red
1  banana    yellow
2  cherry  dark red
3    date     brown

In [4]:
class Employee:
    def __init__(self, eno, name, grade):
        self.eno = eno
        self.name = name
        self.grade = grade
        
    def __str__(self):
        return f"{self.name}({self.eno})"
        
    def method(self):
        print("Hello, my name is " + self.name + ", my roll no is " + str(self.eno))

e = Employee(452, 'Kohli', 'A')
e.eno = 17
e.method()

Hello, my name is Kohli, my roll no is 17

In [5]:
del e.grade

In [6]:
e.method()

Hello, my name is Kohli, my roll no is 17

In [7]:
del e

In [10]:
class Info():
    def __init__(self,fname,lname):
        self.firstname = fname
        self.lastname = lname

    def method(self):
        print(self.firstname,self.lastname)

i = Info("virat","kohli")
i.method()

virat kohli

In [14]:
# Single inheritance
#A parent class having one child class
class Employee:
    def __init__(self, eno, name, grade):
        self.eno = eno
        self.name = name
        self.grade = grade
        
    def method1(self):
        print("This is the parent class")

class Child(Employee):
    def method2(self):
        print("This is the child class")

# Create an instance of Employee
e = Employee(452, 'Kohli', 'A')
#e.method1()

# Create an instance of Child
c = Child(453, 'Rohit', 'B')
c.method1()  
c.method2()
c.eno

This is the parent class
This is the child class

453

In [22]:
#example for multiple inheritace
#two parents classes can having same child class
class Adminstration:
    def __init__(self,principal):
        self.principal = principal

    def f1(self):
        print(self.principal)

class Department:
    def __init__(self,department):
        self.department = department

    def f2(self):
        return self.department

class Student(Adminstration,Department):
    def __init__(self,principal,department):
        Adminstration.__init__(self,principal)
        Department.__init__(self,department)
        
    def f3(self):
        print(self.principal,self.department)

s=Student("Giri","ECE")
s.f3()

Giri ECE

In [24]:
#example for multilevel inheritace
it contains parent class having one child class then that child acts as parent to another child class
class Adminstration:
    def __init__(self,principal):
        self.principal = principal

class Department(Adminstration):
    def __init__(self,department,principal):
        self.department = department
        Adminstration.__init__(self,principal)
        
class Student(Department):
    def __init__(self,stdname,principal,department):
        self.stdname = stdname
        Department.__init__(self,department,principal)
        
    def f3(self):
        print(self.principal,self.department,self.stdname)

s=Student("malli","Giri","ECE")
s.f3()

Giri ECE malli

In [26]:
#Hierarchial inheritance
#One parent class and multiple child classes assigned to that parent class
class Parent:
    def  p(self):
        print("this is parent class")
class Child1(Parent):
    def c1(self):
        print("this is child class(c1)")
class Child2(Parent):
    def c2(self):
        print("this is child class(c2)")

o1 = Child1()
o2 = Child2()
o1.c1()
o1.p()

this is child class(c1)
this is parent class

In [28]:
o2.c2()

this is child class(c2)

In [29]:
#Hybrid Inheritance


class ClassF:
    def f(self):
        print("this is parent class(F)")
class ClassB:
    def b(self):
        print("this is child class for F and Parent class for A and C")
class ClassA(ClassB):
    def a(self):
        print("This is child class for B(a)")
class ClassC(ClassB):
    def c(self):
        print("This is child class for B(c)")

class ClassG:
    def g(self):
        print("This is parent class for e")
class ClassE(ClassG,ClassF):
    def e(self):
        print("This is the child class for F and G")

In [31]:
a1=ClassA()
a1.a()

This is child class for B(a)

In [32]:
e1=ClassE()
e1.f()
e1.g()

this is parent class(F)
This is parent class for e

In [33]:
country_grp = df.groupby['Country']
country_grp['socialmedia'].value_counts().loc['India']

NameError: name 'df' is not defined

In [43]:
import pandas as pd
import numpy as np

# Create a date range
dates = pd.date_range(start='2023-01-01', periods=10, freq='B')  # Business days

# Generate random stock data
np.random.seed(42)  # For reproducibility
data = {
    'Date': dates,
    'Open': np.random.uniform(100, 200, size=len(dates)),
    'High': np.random.uniform(200, 300, size=len(dates)),
    'Low': np.random.uniform(50, 100, size=len(dates)),
    'Close': np.random.uniform(100, 250, size=len(dates)),
    'Volume': np.random.randint(1000, 10000, size=len(dates)),
}

# Create DataFrame
stock_df = pd.DataFrame(data)

# Optionally set the Date as the index
#stock_df.set_index(inplace=True)
stock_df.set_index(dates, inplace=True)
# Display the DataFrame
print(stock_df)

                 Date        Open        High        Low       Close  Volume
2023-01-02 2023-01-02  137.454012  202.058449  80.592645  191.131728    1775
2023-01-03 2023-01-03  195.071431  296.990985  56.974693  125.578619    9226
2023-01-04 2023-01-04  173.199394  283.244264  64.607232  109.757739    4152
2023-01-05 2023-01-05  159.865848  221.233911  68.318092  242.332831    2585
2023-01-06 2023-01-06  115.601864  218.182497  72.803499  244.844805    4943
2023-01-09 2023-01-09  115.599452  218.340451  89.258798  221.259602    8555
2023-01-10 2023-01-10  105.808361  230.424224  59.983689  145.692065    4073
2023-01-11 2023-01-11  186.617615  252.475643  75.711722  114.650817    2021
2023-01-12 2023-01-12  160.111501  243.194502  79.620728  202.634954    4843
2023-01-13 2023-01-13  170.807258  229.122914  52.322521  166.022874    8989

In [37]:
stock_df.shape

(10, 5)

In [45]:
stock_df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [46]:
import datetime as dt
stock_df['Day Of Week'] = stock_df['Date'].dt.day_name()

In [47]:
stock_df

,Date,Open,High,Low,Close,Volume,Day Of Week
2023-01-02,2023-01-02,137.454012,202.058449,80.592645,191.131728,1775,Monday
2023-01-03,2023-01-03,195.071431,296.990985,56.974693,125.578619,9226,Tuesday
2023-01-04,2023-01-04,173.199394,283.244264,64.607232,109.757739,4152,Wednesday
2023-01-05,2023-01-05,159.865848,221.233911,68.318092,242.332831,2585,Thursday
2023-01-06,2023-01-06,115.601864,218.182497,72.803499,244.844805,4943,Friday
2023-01-09,2023-01-09,115.599452,218.340451,89.258798,221.259602,8555,Monday
2023-01-10,2023-01-10,105.808361,230.424224,59.983689,145.692065,4073,Tuesday
2023-01-11,2023-01-11,186.617615,252.475643,75.711722,114.650817,2021,Wednesday
2023-01-12,2023-01-12,160.111501,243.194502,79.620728,202.634954,4843,Thursday
2023-01-13,2023-01-13,170.807258,229.122914,52.322521,166.022874,8989,Friday

In [48]:
stock_df['Date'].min()

Timestamp('2023-01-02 00:00:00')

In [49]:
stock_df['Date'].max()

Timestamp('2023-01-13 00:00:00')

In [51]:
pd.to_datetime(stock_df['Date'].max())

Timestamp('2023-01-13 00:00:00')

In [7]:
for i in range(10):
    if i==2:
        break
    print(i)

0
1

In [8]:
for i in range(10):
    if i==5:
        continue
    print(i)

0
1
2
3
4
6
7
8
9

In [9]:
for i in range(4):
    if i==3:
        pass
    print(i)

0
1
2
3

import math
n1=5.6
n2=-1.4
s1=math.floor(n1)
s2=math.floor(n2)
print(s1)
print(s2)